import Image from 'next/image';

function Blog() {
  //   const list = [
  //     {
  //       title: 'Правильна Техніка',
  //       description:
  //         'Перш за все, велика увага має бути приділена правильній техніці виконання станової тяги. Початківцям особливо важливо отримати настанови від досвідченого тренера. Поступово збільшуйте вагу, але не на шкоду правильності виконання руху.',
  //     },
  //     {
  //       title: 'Нагрівання',
  //       description:
  //         "Перш ніж перейти до важких навантажень, не забувайте розігрівати м'язи. Загальне нагрівання перед тренуванням та спеціальні розтяжки для спини та ніг допоможуть уникнути травм та покращити результати.",
  //     },
  //     {
  //       title: 'Коректне Постановка Тіла',
  //       description:
  //         "Важливо дотримуватись правильної постановки тіла: п'яти, стегон та плечів повинні бути на одній лінії. Зігнуті коліна легко забезпечать стабільність під час підняття штанги.",
  //     },
  //   ];
  //   return (
  //     <section className="section-blog-item">
  //       <div className="div-conteiter-blog">
  //         <h1 className="h1-title-blog">Як накачати біцепс?</h1>
  //         <p className="description">
  //           Щоб збільшити м’язи біцепса, вам потрібно зосередитися на поєднанні
  //           силових тренувань, правильного харчування та достатнього відпочинку та
  //           відновлення. Ось кілька порад, які допоможуть вам ефективно наростити
  //           біцепс:
  //         </p>
  //         <div className="div-for-img"></div>
  //         <ol className="ol-list">
  //           {list.map(element => (
  //             <li key={element.title}>
  //               <h2 className="h2-list-title ">{element.title}</h2>
  //               <p className="p-list">{element.description}</p>
  //             </li>
  //           ))}
  //         </ol>
  //         <p className="p-text">
  //           Станова тяга ривком - це потужна вправа, що може привести до видатних
  //           результатів, якщо виконана з правильною технікою та зосередженістю.
  //         </p>
  //         <p className="p-text">
  //           Наш тренажерний зал пропонує індивідуальний підхід до кожного,
  //           професійних тренерів та збалансовану систему харчування, що допоможе
  //           досягти ваших спортивних цілей. Приходьте до нас та починайте свій
  //           шлях до здоров'я та гармонії!
  //         </p>
  //       </div>
  //     </section>
  //   );
  //
  return (
    <section className="section-blog-item">
      <div className="div-conteiter-blog">
        <h1 className="h1-title-blog">
          Заправляємо тренування: Харчування до та після тренування
        </h1>
        <p className="description">
          Харчування відіграє життєво важливу роль у досягненні максимальної
          продуктивності під час тренувань та сприянні оптимальному відновленню.
          Те, що ви їсте до і після тренування, може суттєво вплинути на рівень
          енергії, витривалість і відновлення м'язів. У цій статті ми розглянемо
          ключові елементи перед- та післятренувального харчування, які
          допоможуть вам досягти ваших фітнес-цілей з добре підживленим тілом.
        </p>
        <Image
          src=""
          alt="Коли тренуватись? - Ранок проти вечора"
          className="div-conteiter-blog"
        />
        <h2 className="h2-list-title ">Харчування перед тренуванням:</h2>
        <ul className="ul-list-none ">
          <li className="p-item">
            <h2 className="h2-list-title ">1. Вуглеводи для енергії: </h2>
            Споживайте легкозасвоювані вуглеводи перед тренуванням, щоб
            забезпечити себе легкодоступним джерелом енергії. Віддавайте
            перевагу цільним злакам, фруктам або невеликій порції каш з низьким
            вмістом клітковини.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">
              2. Білок для стабільної працездатності:
            </h2>
            Вживання помірної кількості білка перед тренуванням може допомогти
            підтримувати м'язову активність під час тренування. Розгляньте такі
            джерела, як грецький йогурт, протеїновий коктейль або невелика
            порція нежирного м'яса.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">
              3. Гідратація є ключовим фактором:{' '}
            </h2>
            Пийте воду або напої, багаті на електроліти, щоб підтримувати баланс
            рідини та оптимальну працездатність.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">4. Час має значення: </h2>
            Намагайтеся з'їсти їжу перед тренуванням або перекусити приблизно за
            1-2 години до тренування. Якщо ви віддаєте перевагу меншим
            перекусам, споживайте їх за 30 хвилин до години до тренування.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">
              5. Уникайте важкої та жирної їжі:{' '}
            </h2>
            Уникайте важкої, жирної їжі, яка може викликати дискомфорт під час
            тренування. Це може сповільнити травлення і вплинути на рівень
            енергії.
          </li>
        </ul>
        <h2 className="h2-list-title ">Харчування після тренування:</h2>
        <ul className="ul-list-none ">
          <li className="p-item">
            <h2 className="h2-list-title ">
              1. Поповнення запасів глікогену:{' '}
            </h2>
            Після тренування заправтеся вуглеводами, щоб поповнити виснажені
            запаси глікогену в м'язах. Найкраще їсти фрукти, цільнозернові
            продукти та солодку картоплю.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">
              2. Білок для відновлення м'язів:{' '}
            </h2>
            Споживайте багаті на білок закуски (батончики) або їжу, щоб
            підтримати відновлення та відновлення м'язів. Нежирні білки, такі як
            куряче м'ясо, тофу або квасоля - чудовий вибір.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">3. Важливою є гідратація: </h2>
            Відновлюйте водний баланс після тренування, випиваючи воду або
            спортивний напій з електролітами, щоб замінити рідину, втрачену
            через піт.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">4. Час має вирішальне значення: </h2>
            Намагайтеся їсти протягом 45-60 хвилин - години після тренування,
            щоб оптимізувати відновлення. Саме в цей час ваш організм найбільш
            сприйнятливий до засвоєння поживних речовин.
          </li>
          <li className="p-item">
            <h2 className="h2-list-title ">5. Включіть антиоксиданти: </h2>
            Продукти, багаті на антиоксиданти, такі як ягоди і темна листова
            зелень, можуть допомогти зменшити окислювальний стрес, викликаний
            фізичними навантаженнями, і підтримати загальне відновлення.
          </li>
        </ul>
        <p className="p-text">
          <strong> Висновок: </strong> Правильне харчування до і після
          тренування має важливе значення для досягнення максимальної
          продуктивності під час тренувань і забезпечення плавного процесу
          відновлення. Добре збалансоване поєднання вуглеводів, білків та
          споживання води додасть енергії під час тренувань, допоможе вам
          подолати труднощі, а також сприятиме відновленню та росту м'язів.
          Підбирайте страви та перекуси відповідно до ваших вподобань та
          інтенсивності тренувань, а також завжди прислухайтеся до сигналів
          свого організму. Пам'ятайте, що персоналізоване харчування відіграє
          важливу роль в оптимізації вашого розвитку та загального самопочуття.
        </p>
      </div>
    </section>
  );
}

export default Blog;
