export const NavLinks = [
  // { href: "/", key: "Main", text: "Головна" },
  { href: "/blog", key: "blog", text: "Блог" },
  { href: "/calcs", key: "calcs", text: "Калькулятори" },
  { href: "/services", key: "services", text: "Послуги" },
  { href: "/contacts", key: "contacts", text: "Контакти" },
];

export const cardInfo = [
  {
    title: "Збалансоване харчування та здорова їжа",
    text: "Ми розуміємо, що правильне харчування - ключ до успіху. Наші тренери допоможуть скласти індивідуальну дієту, що підкреслить ваші досягнення та покращить самопочуття.",
  },
  {
    title: "Фізичні навантаження та догляд за тілом",
    text: "Ми прагнемо, щоб кожне тренування в Адреналіні було неповторним досвідом. Наші професійні тренери не просто супроводжують вас під час занять, вони допомагають досягти найкращих результатів та дбають про ваше тіло.",
  },
  {
    title: "Жити в гармонії з собою, ділитися насолодою з іншими",
    text: "У нас ви не просто займаєтесь фізичною формою, ви стаєте частиною нашої спільноти, де вас чекає підтримка від однодумців. Діліться своїми досягненнями та радощами з іншими, і ми разом з вами переживемо кожну перемогу.",
  },
];
