export const NavLinks = [
  // { href: "/", key: "Main", text: "Головна" },
  { href: "/blog", key: "blog", text: "Блог" },
  { href: "/calcs", key: "calcs", text: "Калькулятори" },
  { href: "/services", key: "services", text: "Послуги" },
  { href: "/contacts", key: "contacts", text: "Контакти" },
];

export const cardInfo = [
  {
    title: "Збалансоване харчування та здорова їжа",
    text: "Ми розуміємо, що правильне харчування - ключ до успіху. Наші тренери допоможуть скласти індивідуальну дієту, що підкреслить ваші досягнення та покращить самопочуття.",
  },
  {
    title: "Фізичні навантаження та догляд за тілом",
    text: "Ми прагнемо, щоб кожне тренування в Адреналіні було неповторним досвідом. Наші професійні тренери не просто супроводжують вас під час занять, вони допомагають досягти найкращих результатів та дбають про ваше тіло.",
  },
  {
    title: "Жити в гармонії з собою, ділитися насолодою з іншими",
    text: "У нас ви не просто займаєтесь фізичною формою, ви стаєте частиною нашої спільноти, де вас чекає підтримка від однодумців. Діліться своїми досягненнями та радощами з іншими, і ми разом з вами переживемо кожну перемогу.",
  },
];

export const serviceCardInfo = [
  {
    src: "/bodybuilder.jpg",
    alt: "Man with dumbells",
    title: "Тренування",
    text: "Тренування на професійному обладнанні в чистому, просторому приміщенні тренажерного залу Адреналін",
  },
  {
    src: "/bodybuilder.jpg",
    alt: "Man with dumbells",
    title: "Тренування з тренером",
    text: "Передаємо Вам кращий досвід і практикидля досягнення максимально швидкого результату",
  },
  {
    src: "/bodybuilder.jpg",
    alt: "Man with dumbells",
    title: "Харчування від тренера",
    text: "Індивідуальний тижневий план харчування, розроблений спеціально для Вас із врахуванням віку, ваги, Вашої мети",
  },
];
